Tekla Open API Reference for Tekla Structures 2025
AnalysisBeamEnd Class
 The AnalysisBeamEnd class contains information related to analysis beam ends.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisBeamEnd
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisBeamEnd
Public NotInheritable Class AnalysisBeamEnd
The AnalysisBeamEnd type exposes the following members.
Constructors
Name | Description
AnalysisBeamEnd
 Initializes a new instance of the AnalysisBeamEnd class.
Top
Properties
Name | Description
Connectivity
 Gets or sets the connectivity at the beam end.
Eccentricity
 Gets or sets the eccentricity at the beam end (in the member's local coordinate system).
Profile
 Gets or sets the profile at the beam end.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace